#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan and Apply</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teamcarljavier/tf-module-pet-test/runs/run-sxe2CAk9aThxfzVj

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pet.local_file.html will be created
  + resource "local_file" "html" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./index.html"
      + id                   = (known after apply)
    }

  # module.pet.random_pet.nickname will be created
  + resource "random_pet" "nickname" {
      + id        = (known after apply)
      + length    = 5
      + separator = "-"
    }

  # module.pet.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_pet_nickname  = (known after apply)
  + random_string_output = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```

```terraform

Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/teamcarljavier/tf-module-pet-test/runs/run-vZ2uJxziXZxFgeF2

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pet.local_file.html will be created
  + resource "local_file" "html" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./index.html"
      + id                   = (known after apply)
    }

  # module.pet.random_pet.nickname will be created
  + resource "random_pet" "nickname" {
      + id        = (known after apply)
      + length    = 5
      + separator = "-"
    }

  # module.pet.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_pet_nickname  = (known after apply)
  + random_string_output = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

------------------------------------------------------------------------

module.pet.random_pet.nickname: Creation complete after 0s [id=arguably-terminally-thoroughly-square-alpaca]
module.pet.random_string.random: Creating...
module.pet.random_string.random: Creation complete after 0s [id=3Rtzf]
module.pet.local_file.html: Creating...
module.pet.local_file.html: Creation complete after 0s [id=9862bf5e133602cec2244121289737568c84062f]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

random_pet_nickname = "arguably-terminally-thoroughly-square-alpaca"
random_string_output = "3Rtzf"

```

</details>

*Pushed by: @carljavier, Action: `pull_request`*